// Stability AI промпти для генерації зображень

export const stabilityImagePrompt = (formData) => {
  return `Сформуй короткий, художній промт для генерації зображення через Stability AI, стиль зображення - ${formData.cardStyle}, настрій зображення - ${formData.cardMood}, та враховуй наступне фото: ${formData.photoUrl}, для генерації подібних речей, персонажів або для натхнення сюжету.
Додай до композиції сюжету наступні атрибути та символи або ті речі які прямо асоціюються з наступними хобі, захопленнями або родом діяльності: ${formData.hobbies}. Вбудуй їх логічно та послідовно до композиції щоб все було на своїх місцях та доповнювало сюжет.
Також врахуй риси та цінності особистості: ${formData.traits}. Відобрази ці якості через візуальні символи, емоції, атмосферу або деталі композиції.
Також для генерації сюжету використовуй атрибути, символи та сенси з наступного тексту привітання: ${formData.greetingText}.
Саме згенероване зображення має бути без тексту.`;
};

export const stabilitySimpleImagePrompt = (formData) => {
  return `Стиль: ${formData.cardStyle}, настрій: ${formData.cardMood}. Створи красиве зображення для привітання.`;
};

export const stabilityCatImagePrompt = (formData) => {
  return `Стиль: ${formData.cardStyle}, настрій: ${formData.cardMood}. Створи зображення з кішкою для привітання. Хобі: ${formData.hobbies}.`;
}; 